Revit 2024 API
GroupTypeId.FabricationProductData Property
 Fabrication Product Data.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2024
Syntax
C#
public static ForgeTypeId FabricationProductData { get; }
Visual Basic
Public Shared ReadOnly Property FabricationProductData As ForgeTypeId
	Get
Visual C++
public:
static property ForgeTypeId^ FabricationProductData {
	ForgeTypeId^ get ();
}
See Also
GroupTypeId Class
Autodesk.Revit.DB Namespace